# Haulage company APS_FAILURE_SET_ANALYSIS

## Add cover_sheet

# Refrences
1. Hector Cuesta (2013) Practical Data Analysis. Birmingham, UK: Packt Publishing. Available at: https://search.ebscohost.com/login.aspx?direct=true&db=e250xww&AN=654543&site=eds-live&scope=site (Accessed: 18 October 2023).

# 1 : Introduction 
### 1.1 What is data
Data are plain facts gathered within a defined context. Statistians would refer to it has set of obsevations, which contain variables or column of varying/unique characteristic. Data can also be referred to as a piece of information after it has been summarised, and when subjected to analysis, data can be reffered to as an evidence of a hypothesis. Before data can become an information and utilmately an evidence it must go through a process. Data analysis is the process in which raw data is ordered and organized, to be used in methods that help to explain the past and predict the future (Hector, 2013). I have been retained by Haulage company to get information and ultimately evidence from their 'aps_failure_set' data-set and to do this i will be using the process of data analysis 
### 1.2 Understanding dataset
Disclaimer: This is a summary of the information provided by David

'aps_failure_set' dataset was collected from the everyday usage of heavy Scania trucks. Data has been collected specifically on Air Pressure system (APS) and stored in comma-separated value(csv) file. The sytem generates generates pressurised air that are utilized in various functions in a truck, such as braking and gear changes. 
## 1.3 Problem definination
H company wants an analysis of the data colleted, to help determine the investment strategy for the upcoming year. 

Company wants an anlysis of failure's, and see information of failuures related to APS relative to thos fai;ures not related to APS. 
they had in sytemsDataset seek t positive class consists of component failures for a specific component of the APS system.


and it has been stroed in comma separated format

in methods that help to explain the past and predict the future. 
in methods that help to explain the past and predict the future. 
**talking about python:** Though the project breif specifically instructed that this analyssis be carried out using python jupytanoot book only, for the purpose of infor mation it is worth noting thta python is the...... **Then proceed to talk about its unique future comprared to other DA language**

In [2]:
#Importing packages i need for EDA
import pandas as pd 
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

# Early data anlysis (EDA)

In [3]:
# reading dataset using pandas
air_p= pd.read_csv('aps_failure_set.csv')

In [32]:
#Geeting the first five rows of the data 
air_p.head()

,class,aa_000,ab_000,ac_000,ad_000,ae_000,af_000,ag_000,ag_001,ag_002,...,ee_002,ee_003,ee_004,ee_005,ee_006,ee_007,ee_008,ee_009,ef_000,eg_000
0,neg,76698,na,2130706438,280,0,0,0,0,0,...,1240520,493384,721044,469792,339156,157956,73224,0,0,0
1,neg,33058,na,0,na,0,0,0,0,0,...,421400,178064,293306,245416,133654,81140,97576,1500,0,0
2,neg,41040,na,228,100,0,0,0,0,0,...,277378,159812,423992,409564,320746,158022,95128,514,0,0
3,neg,12,0,70,66,0,10,0,0,0,...,240,46,58,44,10,0,0,0,4,32
4,neg,60874,na,1368,458,0,0,0,0,0,...,622012,229790,405298,347188,286954,311560,433954,1218,0,0

In [31]:
#Getting the last five row of the dataset
air_p.tail()

,class,aa_000,ab_000,ac_000,ad_000,ae_000,af_000,ag_000,ag_001,ag_002,...,ee_002,ee_003,ee_004,ee_005,ee_006,ee_007,ee_008,ee_009,ef_000,eg_000
59995,neg,153002,na,664,186,0,0,0,0,0,...,998500,566884,1290398,1218244,1019768,717762,898642,28588,0,0
59996,neg,2286,na,2130706538,224,0,0,0,0,0,...,10578,6760,21126,68424,136,0,0,0,0,0
59997,neg,112,0,2130706432,18,0,0,0,0,0,...,792,386,452,144,146,2622,0,0,0,0
59998,neg,80292,na,2130706432,494,0,0,0,0,0,...,699352,222654,347378,225724,194440,165070,802280,388422,0,0
59999,neg,40222,na,698,628,0,0,0,0,0,...,440066,183200,344546,254068,225148,158304,170384,158,0,0

In [6]:
# checking for the size of the data
air_p.shape
#There are 60000 rows and 171 columns

(60000, 171)

In [15]:
# need more infor on the data types 
air_p.info()
#Wecan see that this give a more precice response, stating that the are 170 object i.e columns that are categorical or has
# strings in them making them return object and we have 1 numerical column or has int in its entry which is the class.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60000 entries, 0 to 59999
Columns: 171 entries, class to eg_000
dtypes: int64(1), object(170)
memory usage: 78.3+ MB

## Alot of features
Using the .shape method, i can see that i have 171 feautures  but the 'air_p' df displays only 20 features. Using the .info method, i can see that my class feauture is object, and only one censure 'aa_000' returns to be integer,and 169 feautures are objectives.
I would like to be able to work with individual feautur and explore it. To do this, i will load the dataset in phases using indexing.

In [54]:
# The AP1 df returns the first 20 features and all the rows
AP1= air_p.iloc[ : , :20]
AP1.head()

,class,aa_000,ab_000,ac_000,ad_000,ae_000,af_000,ag_000,ag_001,ag_002,ag_003,ag_004,ag_005,ag_006,ag_007,ag_008,ag_009,ah_000,ai_000,aj_000
0,neg,76698,na,2130706438,280,0,0,0,0,0,0,37250,1432864,3664156,1007684,25896,0,2551696,0,0
1,neg,33058,na,0,na,0,0,0,0,0,0,18254,653294,1720800,516724,31642,0,1393352,0,68
2,neg,41040,na,228,100,0,0,0,0,0,0,1648,370592,1883374,292936,12016,0,1234132,0,0
3,neg,12,0,70,66,0,10,0,0,0,318,2212,3232,1872,0,0,0,2668,0,0
4,neg,60874,na,1368,458,0,0,0,0,0,0,43752,1966618,1800340,131646,4588,0,1974038,0,226

In [74]:
missing_value_formats = ["n.a.","...""NA" "na", "--"]
df = pd.read_csv('aps_failure_set.csv', na_values = missing_value_formats)

In [75]:
df.head()

,class,aa_000,ab_000,ac_000,ad_000,ae_000,af_000,ag_000,ag_001,ag_002,...,ee_002,ee_003,ee_004,ee_005,ee_006,ee_007,ee_008,ee_009,ef_000,eg_000
0,neg,76698,na,2130706438,280,0,0,0,0,0,...,1240520,493384,721044,469792,339156,157956,73224,0,0,0
1,neg,33058,na,0,na,0,0,0,0,0,...,421400,178064,293306,245416,133654,81140,97576,1500,0,0
2,neg,41040,na,228,100,0,0,0,0,0,...,277378,159812,423992,409564,320746,158022,95128,514,0,0
3,neg,12,0,70,66,0,10,0,0,0,...,240,46,58,44,10,0,0,0,4,32
4,neg,60874,na,1368,458,0,0,0,0,0,...,622012,229790,405298,347188,286954,311560,433954,1218,0,0

In [55]:
AP1.shape

(60000, 20)

In [56]:
AP1.isnull().sum()

class     0
aa_000    0
ab_000    0
ac_000    0
ad_000    0
ae_000    0
af_000    0
ag_000    0
ag_001    0
ag_002    0
ag_003    0
ag_004    0
ag_005    0
ag_006    0
ag_007    0
ag_008    0
ag_009    0
ah_000    0
ai_000    0
aj_000    0
dtype: int64

In [57]:
AP1.dtypes

class     object
aa_000     int64
ab_000    object
ac_000    object
ad_000    object
ae_000    object
af_000    object
ag_000    object
ag_001    object
ag_002    object
ag_003    object
ag_004    object
ag_005    object
ag_006    object
ag_007    object
ag_008    object
ag_009    object
ah_000    object
ai_000    object
aj_000    object
dtype: object

### storing unique features
1. na

## Exploring each feature in AP1
The censor systems all came back as onject which means the are some objects in the feautures, i wish to explore the unique features ineach columns to be able to fixt the datatypes

In [58]:
# Unique values in class
df= AP1["class"].unique()
print(df)

['neg' 'pos']

In [60]:
# Getting the unique values in the class column to be able to veiw the integer
# The 'ab_000' column should be integer but we have some missing values in it that has been replaced with 'na'
AP1['ab_000'].head(10)

0    na
1    na
2    na
3     0
4    na
5    na
6     0
7    na
8    na
9     0
Name: ab_000, dtype: object

In [61]:
# To get all the uniqe values in the 'ab_000'
# the '.unique()' compared to the '.head()' returns all the uniqe data tpyes i have in the column helping me to see all the
# rows that are not integers
AP1['ab_000'].unique()
# we can see that 'na' is the only type of str we have in the column which represent null values

array(['na', '0', '2', '4', '6', '8', '18', '10', '12', '16', '204', '24',
       '134', '90', '26', '14', '34', '52', '20', '22', '30', '36', '100',
       '48', '58', '32', '28', '44', '46', '68'], dtype=object)

In [62]:
AP1['ac_000'].unique()

array(['2130706438', '0', '228', ..., '8974', '123514', '2602'],
      dtype=object)

In [68]:
#df= AP1['ac_000']
#print(df)
air_p.dtypes.value_counts()

object    170
int64       1
dtype: int64

In [69]:
AP1['ad_000'].unique()

array(['280', 'na', '100', ..., '5286', '3608', '194868'], dtype=object)

In [70]:
AP1['ae_000'].unique()

array(['0', '16', '104', 'na', '2', '222', '4', '290', '1286', '170', '6',
       '806', '1464', '274', '18', '8', '342', '64', '34', '192', '144',
       '176', '1512', '120', '58', '114', '460', '12', '112', '1314',
       '20', '550', '36', '1424', '180', '324', '204', '254', '106',
       '154', '92', '256', '202', '352', '26', '124', '2240', '466',
       '778', '28', '100', '14', '276', '42', '82', '22', '384', '282',
       '386', '98', '164', '108', '86', '38', '266', '1056', '134', '10',
       '200', '150', '326', '350', '398', '424', '32', '128', '752',
       '314', '732', '2312', '400', '158', '668', '30', '212', '224',
       '950', '4726', '60', '226', '388', '640', '258', '62', '206', '44',
       '414', '458', '78', '492', '308', '52', '50', '162', '24', '662',
       '536', '456', '130', '140', '184', '368', '146', '118', '138',
       '872', '530', '1118', '356', '218', '126', '102', '1130', '12048',
       '1508', '396', '374', '658', '816', '556', '216', '66', '760',
       '136', '220', '280', '46', '462', '788', '360', '416', '348', '74',
       '1124', '88', '242', '580', '84', '378', '94', '406', '442',
       '2750', '4698', '40', '748', '292', '952', '284', '270', '1346',
       '506', '422', '322', '642', '48', '714', '318', '54', '68', '156',
       '70', '3702', '1654', '454', '1452', '76', '380', '72', '294',
       '382', '214', '328', '2276', '248', '680', '182', '160', '938',
       '390', '56', '814', '624', '1200', '1466', '148', '236', '744',
       '172', '1274', '836', '1582', '804', '2672', '470', '654', '794',
       '1372', '664', '484', '1468', '168', '110', '1912', '116', '524',
       '234', '1270', '310', '2468', '612', '228', '486', '246', '2600',
       '142', '1710', '478', '570', '96', '746', '90', '480', '3478',
       '538', '1292', '122', '344', '2572', '600', '468', '962', '540',
       '436', '826', '920', '302', '618', '614', '666', '2322', '2662',
       '152', '1420', '296', '366', '188', '488', '894', '1714', '572',
       '522', '702', '320', '208', '238', '500', '762', '542', '336',
       '446', '21050', '404', '698', '2702', '2306', '548', '1614', '864',
       '300', '438', '490', '482', '1520', '186', '304', '940', '132',
       '878', '1012', '376', '2218', '80', '8332', '260', '194', '566',
       '1852', '4520', '1026', '716', '340', '1860', '166', '1176', '784',
       '1116', '504', '174', '264', '430', '604', '1398', '2110', '288',
       '764', '412', '286', '602', '5386', '1412', '2048', '936', '730',
       '2370', '832', '250', '272', '464', '946', '626', '606', '362',
       '700'], dtype=object)

In [73]:
#AP1['af_000'].unique()
AP1['ag_000'].unique()

array(['0', '3382', 'na', '776', '2', '4808', '12', '4372', '11912',
       '454', '13044', '16186', '29794', '876', '8', '34', '63896', '64',
       '3376892', '299736', '206336', '51610', '4436', '16', '242', '104',
       '16462', '21000', '7002', '30', '228', '850604', '170', '760',
       '28', '58096', '6', '268780', '1722', '7212', '8252', '1262',
       '19442', '4', '24', '3718', '223654', '306898', '246', '17706',
       '406', '15626', '14630', '96954', '69054', '544866', '1540',
       '17280', '32', '196', '326', '3272', '1170', '127544', '48', '62',
       '1354', '550', '443614', '22', '48820', '20614', '2664', '234',
       '316', '11486', '318', '22320', '998', '8870', '67966', '50066',
       '1266', '206', '510', '48020', '6772', '2088', '676', '44212',
       '10682', '26884', '156', '360', '136', '1994', '256', '58270',
       '60334', '26', '14', '15980', '2710', '35888', '6604', '124',
       '116', '1134', '82', '45862', '58806', '11184', '1314', '204',
       '193310', '848', '2982', '2514', '6554', '278514', '10318',
       '85016', '2076', '2530', '254', '798', '10952', '23256', '11218',
       '9012', '10226', '930', '10028', '66', '484', '552', '32584', '88',
       '8516', '25126', '2940', '884', '6732', '12162', '72', '55372',
       '27616', '2016', '3304', '10254', '10', '3950', '536290', '36',
       '49536'], dtype=object)

In [8]:
#Checking for missing vales
#air_p.isnull()
# while this code produces some results suggeting that there are no empyty rows
air_p.isnull().sum()

class     0
aa_000    0
ab_000    0
ac_000    0
ad_000    0
         ..
ee_007    0
ee_008    0
ee_009    0
ef_000    0
eg_000    0
Length: 171, dtype: int64

In [48]:
air_p.dtypes

class     object
aa_000     int64
ab_000    object
ac_000    object
ad_000    object
           ...
ee_007    object
ee_008    object
ee_009    object
ef_000    object
eg_000    object
Length: 171, dtype: object

In [50]:
air_p['ab_000'].shape

(60000,)

In [51]:
air_p['ac_000'].shape

(60000,)